

name: "paddle_ocr_gpu"
backend: "python"
max_batch_size: 0

input [
  {
    name: "INPUT0"
    data_type: TYPE_STRING
    dims: [ 1 ]
    optional: true
  },
  {
    name: "INPUT1"
    data_type: TYPE_FP32
    dims: [ -1, -1, 3 ]
    optional: true
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

instance_group [{ kind: KIND_CPU }]